In [2]:
import pandas as pd
import numpy as np

## DataFrame 생성 및 column 할당

In [16]:
df = pd.DataFrame()
df['col0'] = pd.Series([3,2,2,1])
print(df)

   col0
0     3
1     2
2     2
3     1

In [17]:
df['col1'] = pd.Series([85,92,89,95])
print(df)

   col0  col1
0     3    85
1     2    92
2     2    89
3     1    95

In [18]:
df['col2'] = pd.Series(['B','A','B','A'])
print(df)

   col0  col1 col2
0     3    85    B
1     2    92    A
2     2    89    B
3     1    95    A

In [19]:
type(df)

pandas.core.frame.DataFrame

In [20]:
type(df['col0'])

pandas.core.series.Series

In [21]:
type(df['col0'][2])

numpy.int64

In [22]:
type(df['col2'][2])

str

In [23]:
df.columns = ['column0', 'column1','column2']
print(df)

   column0  column1 column2
0        3       85       B
1        2       92       A
2        2       89       B
3        1       95       A

In [24]:
df['column3'] = [1,2,3,4]
print(df)

   column0  column1 column2  column3
0        3       85       B        1
1        2       92       A        2
2        2       89       B        3
3        1       95       A        4

In [25]:
type(df['column3'])

pandas.core.series.Series

In [26]:
df['column4'] = (df['column0'] * df['column1'])
print(df)

   column0  column1 column2  column3  column4
0        3       85       B        1      255
1        2       92       A        2      184
2        2       89       B        3      178
3        1       95       A        4       95

In [27]:
(df['column0'] * df['column1']).sum()

712

In [28]:
(df['column0'] * df['column1']).sum() / df['column0'].sum()

89.0

## DataFrame column 삭제

In [40]:
df = pd.DataFrame()
df['col0'] = pd.Series([3,2,2,1])
df['col1'] = pd.Series([85,92,89,95])
df['col2'] = pd.Series(['B','A','B','A'])
df.columns = ['column0', 'column1','column2']
df['column3'] = [1,2,3,4]
df['column4'] = (df['column0'] * df['column1'])
print(df)

   column0  column1 column2  column3  column4
0        3       85       B        1      255
1        2       92       A        2      184
2        2       89       B        3      178
3        1       95       A        4       95

In [46]:
df.drop(columns='column3', axis=1, inplace=True) # df.drop(columns='column3') 동일, del df['column3']
print(df)

   column0  column1 column2  column4
0        3       85       B      255
1        2       92       A      184
2        2       89       B      178
3        1       95       A       95

In [47]:
df.columns = ['time','score','grade','total']
print(df)

   time  score grade  total
0     3     85     B    255
1     2     92     A    184
2     2     89     B    178
3     1     95     A     95

## DataFrame index 명시

In [52]:
df = pd.DataFrame()
df['time'] = pd.Series([3,2,2,1])
df['score'] = pd.Series([85,92,89,95])
df['grade'] = pd.Series(['B','A','B','A'])
df['total'] = (df['time'] * df['score'])
print(df)

   time  score grade  total
0     3     85     B    255
1     2     92     A    184
2     2     89     B    178
3     1     95     A     95

In [60]:
index = ['수학','영어','사회','과학']
df.index = index
df

    time  score grade  total
수학     3     85     B    255
영어     2     92     A    184
사회     2     89     B    178
과학     1     95     A     95

In [59]:
index = [0,1,2,3]
df.index = index
df

   time  score grade  total
0     3     85     B    255
1     2     92     A    184
2     2     89     B    178
3     1     95     A     95

## DataFrame 열 검색

In [61]:
df = pd.DataFrame([[3,85,'B'],[2,92,'A'],[2,89,'B'],[1,95,'A']],
                  columns=['time','score','grade'],
                  index = ['수학','영어','사회','과학'] )
df['total'] = (df['time'] * df['score'])
print(df)

    time  score grade  total
수학     3     85     B    255
영어     2     92     A    184
사회     2     89     B    178
과학     1     95     A     95

In [62]:
df['time']

수학    3
영어    2
사회    2
과학    1
Name: time, dtype: int64

In [63]:
df[['time','score']]

    time  score
수학     3     85
영어     2     92
사회     2     89
과학     1     95

In [64]:
df[['time','grade']]

    time grade
수학     3     B
영어     2     A
사회     2     B
과학     1     A

In [67]:
df[['time','score']]

    time  score
수학     3     85
영어     2     92
사회     2     89
과학     1     95

In [68]:
df[['time':'grade']]

SyntaxError: invalid syntax (<ipython-input-68-82909649e538>, line 1)

In [71]:
df.columns[0:3]

Index(['time', 'score', 'grade'], dtype='object')

In [76]:
df[df.columns[0:3]]

    time  score grade
수학     3     85     B
영어     2     92     A
사회     2     89     B
과학     1     95     A

## DataFrame 행 검색 : loc, iloc

In [78]:
df = pd.DataFrame([[3,85,'B'],[2,92,'A'],[2,89,'B'],[1,95,'A']], 
                  columns=['time','score','grade'], 
                  index = ['수학','영어','사회','과학'] )
df['total'] = (df['time'] * df['score'])
print(df)

    time  score grade  total
수학     3     85     B    255
영어     2     92     A    184
사회     2     89     B    178
과학     1     95     A     95

In [41]:
df.loc['수학']

time       3
score     85
grade      B
total    255
Name: 수학, dtype: object

In [42]:
df.loc['수학':'사회']

    time  score grade  total
수학     3     85     B    255
영어     2     92     A    184
사회     2     89     B    178

In [43]:
df.iloc[0:2]

    time  score grade  total
수학     3     85     B    255
영어     2     92     A    184

In [180]:
df.iloc[0:2]

    time  score grade  total
수학     3     85     B    255
영어     2     92     A    184

In [187]:
df.iloc[0:1,0]

    time  score grade  total
수학     2     85     B    255
영어     2     92     A    184
사회     2     89     B    178
과학     1     95     A     95

In [44]:
df.loc[0:2]

TypeError: cannot do slice indexing on <class 'pandas.core.indexes.base.Index'> with these indexers [0] of <class 'int'>

## DataFrame 행, 열 검색 : ix, at, iat

In [142]:
df = pd.DataFrame([[3,85,'B'],[2,92,'A'],[2,89,'B'],[1,95,'A']],
                  columns=['time','score','grade'],
                  index = ['수학','영어','사회','과학'] )
df['total'] = (df['time'] * df['score'])
print(df)

    time  score grade  total
수학     3     85     B    255
영어     2     92     A    184
사회     2     89     B    178
과학     1     95     A     95

In [143]:
df.at['수학','score']

85

In [144]:
df.iat[0,1]

85

In [145]:
df.iat[0,1] = 74
print(df)

    time  score grade  total
수학     3     74     B    255
영어     2     92     A    184
사회     2     89     B    178
과학     1     95     A     95

In [147]:
df.iat[0,1] = 85

In [46]:
df.ix['수학','score']

/home/raonbit/anaconda3/envs/tensorflow/lib/python3.6/site-packages/ipykernel_launcher.py:1: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#ix-indexer-is-deprecated
  """Entry point for launching an IPython kernel.

85

In [47]:
df.ix['수학',]

/home/raonbit/anaconda3/envs/tensorflow/lib/python3.6/site-packages/ipykernel_launcher.py:1: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#ix-indexer-is-deprecated
  """Entry point for launching an IPython kernel.

time       3
score     85
grade      B
total    255
Name: 수학, dtype: object

In [48]:
df.ix['수학':'영어',]

/home/raonbit/anaconda3/envs/tensorflow/lib/python3.6/site-packages/ipykernel_launcher.py:1: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#ix-indexer-is-deprecated
  """Entry point for launching an IPython kernel.

    time  score grade  total
수학     3     85     B    255
영어     2     92     A    184

In [49]:
df.ix['수학':'영어',['time','score']]

/home/raonbit/anaconda3/envs/tensorflow/lib/python3.6/site-packages/ipykernel_launcher.py:1: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#ix-indexer-is-deprecated
  """Entry point for launching an IPython kernel.

    time  score
수학     3     85
영어     2     92

In [176]:
df.ix['수학':'영어',['time','score']]

/home/raonbit/anaconda3/envs/tensorflow/lib/python3.6/site-packages/ipykernel_launcher.py:1: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#ix-indexer-is-deprecated
  """Entry point for launching an IPython kernel.

    time  score
수학     3     85
영어     2     92

In [177]:
df.ix[0:2,[0,1]]

/home/raonbit/anaconda3/envs/tensorflow/lib/python3.6/site-packages/ipykernel_launcher.py:1: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#ix-indexer-is-deprecated
  """Entry point for launching an IPython kernel.

    time  score
수학     3     85
영어     2     92

In [52]:
df.ix['수학','영어',['time','score']]

/home/raonbit/anaconda3/envs/tensorflow/lib/python3.6/site-packages/ipykernel_launcher.py:1: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#ix-indexer-is-deprecated
  """Entry point for launching an IPython kernel.

IndexingError: Too many indexers

In [148]:
df.head(3)

    time  score grade  total
수학     3     85     B    255
영어     2     92     A    184
사회     2     89     B    178

In [150]:
df.tail()

    time  score grade  total
수학     3     85     B    255
영어     2     92     A    184
사회     2     89     B    178
과학     1     95     A     95

## DataFrame 생성 : list, zip

In [70]:
time = [3,2,2,1]
score = [85,92,89,95]
grade = ['B','A','B','A']
dataSet = list(zip(time,score,grade))
print(dataSet)

[(3, 85, 'B'), (2, 92, 'A'), (2, 89, 'B'), (1, 95, 'A')]

In [72]:
df = pd.DataFrame(dataSet,
                  columns=['Time','Score','Grade'],
                  index = ['수학','영어','사회','과학'])
print(df)

    Time  Score Grade
수학     3     85     B
영어     2     92     A
사회     2     89     B
과학     1     95     A

## DataFrame 생성 : dict

In [73]:
time = [3,2,2,1]
score = [85,92,89,95]
grade = ['B','A','B','A']
dic = {'time':time, 'score':score, 'grade':grade}
print(dic)

{'time': [3, 2, 2, 1], 'score': [85, 92, 89, 95], 'grade': ['B', 'A', 'B', 'A']}

In [74]:
df1 = pd.DataFrame(dic, index=['수학','영어','사회','과학'])
print(df1)

    time  score grade
수학     3     85     B
영어     2     92     A
사회     2     89     B
과학     1     95     A

## DataFrame 생성 : Series – column, index 자동 처리

In [75]:
time_dic = {'수학':3,'영어':2,'사회':2,'과학':1}
score_dic = {'수학':85,'영어':92,'사회':89,'과학':95}
grade_dic = {'수학':'B','영어':'A','사회':'B','과학':'A'}
time = pd.Series(time_dic)
score = pd.Series(score_dic)
grade = pd.Series(grade_dic)
print(time);print(score);print(grade)

수학    3
영어    2
사회    2
과학    1
dtype: int64
수학    85
영어    92
사회    89
과학    95
dtype: int64
수학    B
영어    A
사회    B
과학    A
dtype: object

In [76]:
dataSet_dic = {'time':time, 'score':score, 'grade':grade}
print(dataSet_dic)

{'time': 수학    3
영어    2
사회    2
과학    1
dtype: int64, 'score': 수학    85
영어    92
사회    89
과학    95
dtype: int64, 'grade': 수학    B
영어    A
사회    B
과학    A
dtype: object}

In [77]:
df2 = pd.DataFrame(dataSet_dic)
print(df2)

    time  score grade
수학     3     85     B
영어     2     92     A
사회     2     89     B
과학     1     95     A

## MultiIndex로 Series, DataFrame 생성
### MutiIndex 생성

In [78]:
arrays = [['bar', 'bar', 'baz', 'baz', 'foo', 'foo', 'qux', 'qux'],
          ['one', 'two', 'one', 'two', 'one', 'two', 'one', 'two']]
tuples = list(zip(*arrays))
print(tuples)

[('bar', 'one'), ('bar', 'two'), ('baz', 'one'), ('baz', 'two'), ('foo', 'one'), ('foo', 'two'), ('qux', 'one'), ('qux', 'two')]

In [79]:
index = pd.MultiIndex.from_tuples(tuples, names=['first', 'second'])
print(index)

MultiIndex(levels=[['bar', 'baz', 'foo', 'qux'], ['one', 'two']],
           labels=[[0, 0, 1, 1, 2, 2, 3, 3], [0, 1, 0, 1, 0, 1, 0, 1]],
           names=['first', 'second'])

In [81]:
iterables = [['bar', 'baz', 'foo', 'qux'], ['one', 'two']]
pd.MultiIndex.from_product(iterables, names=['first', 'second'])

MultiIndex(levels=[['bar', 'baz', 'foo', 'qux'], ['one', 'two']],
           labels=[[0, 0, 1, 1, 2, 2, 3, 3], [0, 1, 0, 1, 0, 1, 0, 1]],
           names=['first', 'second'])

### MultiIndex 내부 구조

In [82]:
type(index)

pandas.core.indexes.multi.MultiIndex

In [83]:
index.labels[0]

FrozenNDArray([0, 0, 1, 1, 2, 2, 3, 3], dtype='int8')

In [84]:
index.get_level_values(0) # index.get_level_values('first')

Index(['bar', 'bar', 'baz', 'baz', 'foo', 'foo', 'qux', 'qux'], dtype='object', name='first')

In [85]:
index.get_level_values(1) # index.get_level_values(‘second')

Index(['one', 'two', 'one', 'two', 'one', 'two', 'one', 'two'], dtype='object', name='second')

In [86]:
index.labels[1]

FrozenNDArray([0, 1, 0, 1, 0, 1, 0, 1], dtype='int8')

### Series, DataFrame 생성

In [87]:
pd.Series(np.random.randn(8), index=index)

first  second
bar    one       0.273239
       two      -0.116655
baz    one       0.074353
       two       0.389096
foo    one       0.046673
       two       0.918892
qux    one      -0.529492
       two       1.854055
dtype: float64

In [89]:
pd.DataFrame(np.random.randn(8, 4), index=index)

                     0         1         2         3
first second
bar   one     1.507281 -2.153320  0.691856  1.025761
      two    -0.166344 -0.227308 -1.513754 -0.767077
baz   one    -0.596351 -0.483586  0.760085  0.387776
      two    -0.600408 -0.625930  0.326309 -0.579335
foo   one     0.525771 -0.236986 -2.166645 -1.055028
      two    -0.676611 -2.241302 -0.876437  0.652969
qux   one    -0.352294  0.580092  2.006460  1.337023
      two    -3.492436 -1.184855 -0.991467 -1.873529

## MultiIndex 객체 대신 array로 Multi-Level DataFrame 생성

In [42]:
arrays = [np.array(['bar', 'bar', 'baz', 'baz', 'foo', 'foo', 'qux', 'qux']),
          np.array(['one', 'two', 'one', 'two', 'one', 'two', 'one', 'two'])]
print(arrays)

[array(['bar', 'bar', 'baz', 'baz', 'foo', 'foo', 'qux', 'qux'],
      dtype='<U3'), array(['one', 'two', 'one', 'two', 'one', 'two', 'one', 'two'],
      dtype='<U3')]

In [43]:
pd.Series(np.random.randn(8), index=arrays)

bar  one   -0.251928
     two   -0.719589
baz  one   -0.316053
     two    0.306445
foo  one   -1.022335
     two    1.426846
qux  one    0.211688
     two   -1.250555
dtype: float64

In [44]:
pd.DataFrame(np.random.randn(8, 4), index=arrays)

                0         1         2         3
bar one -0.346527 -0.105056  1.439124  0.236957
    two  2.007667 -0.520770  1.574260 -2.160026
baz one -0.449267 -0.934763  0.140109 -0.172005
    two -0.933918  0.404889 -0.703571 -1.445078
foo one -0.918555  3.154296 -2.437695 -0.471341
    two  0.012779 -0.646979 -1.761120 -0.106180
qux one -0.172595  0.626301  1.430576  0.730794
    two -0.716530  0.131100 -2.204952 -0.435983

In [11]:
pd.Series(np.random.randn(8), columns=arrays)

TypeError: __init__() got an unexpected keyword argument 'columns'

In [12]:
pd.DataFrame(np.random.randn(4, 8), columns=index)

NameError: name 'index' is not defined

In [13]:
pd.DataFrame(np.random.randn(4, 8), columns=arrays)

        bar                 baz                 foo                 qux  \
        one       two       one       two       one       two       one
0 -1.252610  0.388119  1.434616 -0.402817  0.881763 -0.132496  1.455528
1 -0.168435  0.847230  0.614532  2.186518  0.667272 -0.583126  0.821486
2 -0.276264  1.609710 -0.308025  0.530710 -0.941151 -0.380864 -1.213087
3 -0.063369  0.729836 -1.738121 -0.667154 -0.080369  2.810690 -0.481314


        two
0  1.803965
1  0.937055
2  1.184520
3  1.639658

In [14]:
pd.DataFrame(np.random.randn(8, 4), index=index)

NameError: name 'index' is not defined

In [15]:
pd.DataFrame(np.random.randn(8, 4), index=index).T

NameError: name 'index' is not defined

## DataFrame MultiIndex 열 검색

In [47]:
df = pd.DataFrame(np.random.randn(4, 8), columns=arrays)
print(df)

        bar                 baz                 foo                 qux  \
        one       two       one       two       one       two       one
0  1.348556  0.572436 -0.457667  0.757976  0.618992  1.073840  0.334832
1 -0.275473  0.590346 -0.267044 -0.575527 -1.019075  0.420414  0.359276
2  0.733608  0.137027  0.282484  0.089875  0.326084 -0.318746  1.795200
3 -1.232120  0.359546  1.397934  1.111288  0.108018  0.135976  1.135283


        two
0  0.889932
1  0.611891
2 -1.185342
3 -0.445498

In [17]:
df['bar']

        one       two
0 -0.020020 -1.307901
1  0.506439  0.242136
2  0.453544  0.957528
3 -1.188751 -3.401343

In [18]:
df['bar', 'one']

0   -0.020020
1    0.506439
2    0.453544
3   -1.188751
Name: (bar, one), dtype: float64

In [19]:
df['bar']['one']

0   -0.020020
1    0.506439
2    0.453544
3   -1.188751
Name: one, dtype: float64

## DataFrame MultiIndex 행 접근 : loc, iloc

In [67]:
df = df.T
print(df)

                0         1         2         3
bar one  1.348556 -0.275473  0.733608 -1.232120
    two  0.572436  0.590346  0.137027  0.359546
baz one -0.457667 -0.267044  0.282484  1.397934
    two  0.757976 -0.575527  0.089875  1.111288
foo one  0.618992 -1.019075  0.326084  0.108018
    two  1.073840  0.420414 -0.318746  0.135976
qux one  0.334832  0.359276  1.795200  1.135283
    two  0.889932  0.611891 -1.185342 -0.445498

In [52]:
df.loc['baz':'foo']

                0         1         2         3
baz one -0.457667 -0.267044  0.282484  1.397934
    two  0.757976 -0.575527  0.089875  1.111288
foo one  0.618992 -1.019075  0.326084  0.108018
    two  1.073840  0.420414 -0.318746  0.135976

In [53]:
df.loc[('baz', 'two'):('foo', 'one')]

                0         1         2         3
baz two  0.757976 -0.575527  0.089875  1.111288
foo one  0.618992 -1.019075  0.326084  0.108018

In [54]:
df.iloc[3:5]

                0         1         2         3
baz two  0.757976 -0.575527  0.089875  1.111288
foo one  0.618992 -1.019075  0.326084  0.108018

In [49]:
df.loc[('bar', 'two'),]

0    0.572436
1    0.590346
2    0.137027
3    0.359546
Name: (bar, two), dtype: float64

In [50]:
df.loc[('bar', 'two'), 0]

0.57243554327846635

In [51]:
df.iloc[1,0]

0.57243554327846635

In [62]:
df.loc[('bar','one'):('baz','one'),1:2]

                1         2
bar one -0.275473  0.733608
    two  0.590346  0.137027
baz one -0.267044  0.282484

In [61]:
df.iloc[0:3,1:3]

                1         2
bar one -0.275473  0.733608
    two  0.590346  0.137027
baz one -0.267044  0.282484

In [64]:
df.loc[:,1:3]

                1         2         3
bar one -0.275473  0.733608 -1.232120
    two  0.590346  0.137027  0.359546
baz one -0.267044  0.282484  1.397934
    two -0.575527  0.089875  1.111288
foo one -1.019075  0.326084  0.108018
    two  0.420414 -0.318746  0.135976
qux one  0.359276  1.795200  1.135283
    two  0.611891 -1.185342 -0.445498

In [65]:
df.iloc[:,1:3]

                1         2
bar one -0.275473  0.733608
    two  0.590346  0.137027
baz one -0.267044  0.282484
    two -0.575527  0.089875
foo one -1.019075  0.326084
    two  0.420414 -0.318746
qux one  0.359276  1.795200
    two  0.611891 -1.185342

## DataFrame MultiIndex 행 접근 : at, iat

In [68]:
print(df)

                0         1         2         3
bar one  1.348556 -0.275473  0.733608 -1.232120
    two  0.572436  0.590346  0.137027  0.359546
baz one -0.457667 -0.267044  0.282484  1.397934
    two  0.757976 -0.575527  0.089875  1.111288
foo one  0.618992 -1.019075  0.326084  0.108018
    two  1.073840  0.420414 -0.318746  0.135976
qux one  0.334832  0.359276  1.795200  1.135283
    two  0.889932  0.611891 -1.185342 -0.445498

In [69]:
df.iat[0,1]

-0.27547319551005045

In [75]:
df.ix[0,1]

/home/raonbit/anaconda3/envs/tensorflow/lib/python3.6/site-packages/ipykernel_launcher.py:1: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#ix-indexer-is-deprecated
  """Entry point for launching an IPython kernel.

-0.27547319551005045

In [70]:
df.iat[0,3]

-1.2321203679093793

In [71]:
df.iat[3,3]

1.1112876396739664

In [72]:
df.at[('bar','one'),3]

-1.2321203679093793

In [76]:
df.ix[('bar','one'),3]

/home/raonbit/anaconda3/envs/tensorflow/lib/python3.6/site-packages/ipykernel_launcher.py:1: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#ix-indexer-is-deprecated
  """Entry point for launching an IPython kernel.

-1.2321203679093793

In [73]:
df.at[('qux','two'),3]

-0.44549832085006869

## DataFrame 데이터 변경

In [116]:
print(df)

                0         1         2         3
bar one  0.270838 -0.285626 -0.357770  2.220243
    two -0.577815 -0.261836  0.087118 -1.315087
baz one  0.691189 -1.382991 -1.045734 -0.324290
    two  0.043585  0.009282 -1.692157  0.102004
foo one  0.877405 -0.726155 -1.105584  0.338738
    two -0.083593 -2.045359 -0.080119  0.330332
qux one  0.187963 -0.856779 -0.118684 -0.592437
    two -1.101259 -0.047270 -1.178592 -1.229185

In [117]:
df[0].sum()

0.30831257246727117

In [121]:
df[0].loc['bar','one'] = '1'  # df.at[('bar','one'),0] = ‘1’ 동일
print(df[0])

bar  one            1
     two    -0.577815
baz  one     0.691189
     two    0.0435851
foo  one     0.877405
     two   -0.0835928
qux  one     0.187963
     two     -1.10126
Name: 0, dtype: object

/home/raonbit/anaconda3/envs/tensorflow/lib/python3.6/site-packages/pandas/core/indexing.py:189: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy
  self._setitem_with_indexer(indexer, value)

In [122]:
df[0].loc['bar','one']

'1'

In [123]:
type(df[0].loc['bar','one'])

str

In [124]:
df[0].loc['bar','two']

-0.5778149121743726

In [125]:
type(df[0].loc['bar','two'])

float

In [126]:
type(df[0])

pandas.core.series.Series

In [127]:
df[0].sum()

TypeError: must be str, not float

In [128]:
df.sum()

1   -5.596733
2   -5.491522
3   -0.469682
dtype: float64

## GroupBy 단일, 멀티 컬럼 기준

In [78]:
arrays = {'first':['bar', 'bar', 'baz', 'baz', 'foo', 'foo', 'qux', 'qux'],
          'second':['one', 'two', 'one', 'two', 'one', 'two', 'one', 'two'],
          'A':np.random.randn(8),
          'B':np.random.randn(8),
          'C':np.random.randn(8),
          'D':np.random.randn(8)}
df = pd.DataFrame(arrays)
print(df)

  first second         A         B         C         D
0   bar    one -1.687999 -0.332860  0.386283 -0.925665
1   bar    two -2.460939  0.931965 -0.110452 -0.561537
2   baz    one -0.103623  0.946880  0.038452 -0.435724
3   baz    two -1.407891  0.096923 -0.893454  0.295049
4   foo    one -0.993727  0.593626  0.203258 -0.559834
5   foo    two -0.201916 -2.193656  0.409474 -0.059413
6   qux    one  0.429566 -0.139827 -0.105988 -1.704868
7   qux    two  2.038877 -1.096001 -2.678503  0.102909

In [83]:
df.groupby('second')

In [79]:
df.groupby('second').sum()

               A         B         C         D
second
one    -2.355783  1.067818  0.522005 -3.626091
two    -2.031870 -2.260769 -3.272935 -0.222993

In [80]:
df.groupby('second').sum().index

Index(['one', 'two'], dtype='object', name='second')

In [82]:
df.groupby(['second','first']).sum()

                     A         B         C         D
second first
one    bar   -1.687999 -0.332860  0.386283 -0.925665
       baz   -0.103623  0.946880  0.038452 -0.435724
       foo   -0.993727  0.593626  0.203258 -0.559834
       qux    0.429566 -0.139827 -0.105988 -1.704868
two    bar   -2.460939  0.931965 -0.110452 -0.561537
       baz   -1.407891  0.096923 -0.893454  0.295049
       foo   -0.201916 -2.193656  0.409474 -0.059413
       qux    2.038877 -1.096001 -2.678503  0.102909

## GroupBy 기준 column index화

In [133]:
df.groupby('first').sum()

              A         B         C         D
first
bar   -0.475620  3.040213  0.442271 -2.782785
baz    1.596732 -1.547954  2.538379  1.373232
foo    1.286857  2.052697 -1.154440  1.530178
qux    2.150018  2.059171  0.146201 -0.028317

In [134]:
type(df.groupby('first').sum())

pandas.core.frame.DataFrame

In [135]:
df.groupby('first').sum()['A']

first
bar   -0.475620
baz    1.596732
foo    1.286857
qux    2.150018
Name: A, dtype: float64

In [136]:
df.groupby('first').sum().loc['bar']

A   -0.475620
B    3.040213
C    0.442271
D   -2.782785
Name: bar, dtype: float64

In [138]:
df.groupby('first', as_index=False).sum()

  first         A         B         C         D
0   bar -0.475620  3.040213  0.442271 -2.782785
1   baz  1.596732 -1.547954  2.538379  1.373232
2   foo  1.286857  2.052697 -1.154440  1.530178
3   qux  2.150018  2.059171  0.146201 -0.028317

In [140]:
df.groupby('first',as_index=False).sum().iloc[0]

first         bar
A        -0.47562
B         3.04021
C        0.442271
D        -2.78278
Name: 0, dtype: object

In [139]:
df.groupby('first',as_index=False).sum().loc['bar']

KeyError: 'the label [bar] is not in the [index]'

## DataFrame 병합 : Merge, join and concatenate

In [88]:
df1 = pd.DataFrame({'A': ['A0', 'A1', 'A2', 'A3'],
                    'B': ['B0', 'B1', 'B2', 'B3'],
                    'C': ['C0', 'C1', 'C2', 'C3'],
                    'D': ['D0', 'D1', 'D2', 'D3']},
                   index=[0, 1, 2, 3])
df2 = pd.DataFrame({'A': ['A4', 'A5', 'A6', 'A7'],
                    'B': ['B4', 'B5', 'B6', 'B7'],
                    'C': ['C4', 'C5', 'C6', 'C7'],
                    'D': ['D4', 'D5', 'D6', 'D7']},
                   index=[4, 5, 6, 7])
df3 = pd.DataFrame({'A': ['A8', 'A9', 'A10', 'A11'],
                    'B': ['B8', 'B9', 'B10', 'B11'],
                    'C': ['C8', 'C9', 'C10', 'C11'],
                    'D': ['D8', 'D9', 'D10', 'D11']},
                   index=[8, 9, 10, 11])

frames = [df1, df2, df3]
print(df1);print();print(df2);print();print(df3);print();
pd.concat(frames)

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3

    A   B   C   D
4  A4  B4  C4  D4
5  A5  B5  C5  D5
6  A6  B6  C6  D6
7  A7  B7  C7  D7

      A    B    C    D
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

      A    B    C    D
0    A0   B0   C0   D0
1    A1   B1   C1   D1
2    A2   B2   C2   D2
3    A3   B3   C3   D3
4    A4   B4   C4   D4
5    A5   B5   C5   D5
6    A6   B6   C6   D6
7    A7   B7   C7   D7
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

In [90]:
result = pd.concat(frames, keys=['x', 'y', 'z'])
print(result)

        A    B    C    D
x 0    A0   B0   C0   D0
  1    A1   B1   C1   D1
  2    A2   B2   C2   D2
  3    A3   B3   C3   D3
y 4    A4   B4   C4   D4
  5    A5   B5   C5   D5
  6    A6   B6   C6   D6
  7    A7   B7   C7   D7
z 8    A8   B8   C8   D8
  9    A9   B9   C9   D9
  10  A10  B10  C10  D10
  11  A11  B11  C11  D11

In [91]:
result.loc['y']

    A   B   C   D
4  A4  B4  C4  D4
5  A5  B5  C5  D5
6  A6  B6  C6  D6
7  A7  B7  C7  D7

In [92]:
df4 = pd.DataFrame({'B': ['B2', 'B3', 'B6', 'B7'],
                    'D': ['D2', 'D3', 'D6', 'D7'],
                    'F': ['F2', 'F3', 'F6', 'F7']},
                   index=[2, 3, 6, 7])
print(df1);print();print(df4)
pd.concat([df1, df4], axis=1, sort=False)

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3

    B   D   F
2  B2  D2  F2
3  B3  D3  F3
6  B6  D6  F6
7  B7  D7  F7

     A    B    C    D    B    D    F
0   A0   B0   C0   D0  NaN  NaN  NaN
1   A1   B1   C1   D1  NaN  NaN  NaN
2   A2   B2   C2   D2   B2   D2   F2
3   A3   B3   C3   D3   B3   D3   F3
6  NaN  NaN  NaN  NaN   B6   D6   F6
7  NaN  NaN  NaN  NaN   B7   D7   F7

In [93]:
print(df1);print();print(df4)
pd.concat([df1, df4], axis=1, join='inner')

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3

    B   D   F
2  B2  D2  F2
3  B3  D3  F3
6  B6  D6  F6
7  B7  D7  F7

    A   B   C   D   B   D   F
2  A2  B2  C2  D2  B2  D2  F2
3  A3  B3  C3  D3  B3  D3  F3

In [173]:
print(df1);print();print(df4)
pd.concat([df1, df4], axis=1, join_axes=[df1.index])

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3

    B   D   F
2  B2  D2  F2
3  B3  D3  F3
6  B6  D6  F6
7  B7  D7  F7

    A   B   C   D    B    D    F
0  A0  B0  C0  D0  NaN  NaN  NaN
1  A1  B1  C1  D1  NaN  NaN  NaN
2  A2  B2  C2  D2   B2   D2   F2
3  A3  B3  C3  D3   B3   D3   F3

In [174]:
print(df1);print();print(df2)
df1.append(df2)

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3

    A   B   C   D
4  A4  B4  C4  D4
5  A5  B5  C5  D5
6  A6  B6  C6  D6
7  A7  B7  C7  D7

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3
4  A4  B4  C4  D4
5  A5  B5  C5  D5
6  A6  B6  C6  D6
7  A7  B7  C7  D7

In [175]:
print(df1);print();print(df4)
df1.append(df4)

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3

    B   D   F
2  B2  D2  F2
3  B3  D3  F3
6  B6  D6  F6
7  B7  D7  F7

/home/raonbit/anaconda3/envs/tensorflow/lib/python3.6/site-packages/pandas/core/frame.py:6201: FutureWarning: Sorting because non-concatenation axis is not aligned. A future version
of pandas will change to not sort by default.

To accept the future behavior, pass 'sort=True'.

To retain the current behavior and silence the warning, pass sort=False

  sort=sort)

     A   B    C   D    F
0   A0  B0   C0  D0  NaN
1   A1  B1   C1  D1  NaN
2   A2  B2   C2  D2  NaN
3   A3  B3   C3  D3  NaN
2  NaN  B2  NaN  D2   F2
3  NaN  B3  NaN  D3   F3
6  NaN  B6  NaN  D6   F6
7  NaN  B7  NaN  D7   F7

In [165]:
df1.append([df2, df3])

      A    B    C    D
0    A0   B0   C0   D0
1    A1   B1   C1   D1
2    A2   B2   C2   D2
3    A3   B3   C3   D3
4    A4   B4   C4   D4
5    A5   B5   C5   D5
6    A6   B6   C6   D6
7    A7   B7   C7   D7
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

In [166]:
 pd.concat([df1, df4], ignore_index=True)

/home/raonbit/anaconda3/envs/tensorflow/lib/python3.6/site-packages/ipykernel_launcher.py:1: FutureWarning: Sorting because non-concatenation axis is not aligned. A future version
of pandas will change to not sort by default.

To accept the future behavior, pass 'sort=True'.

To retain the current behavior and silence the warning, pass sort=False

  """Entry point for launching an IPython kernel.

     A   B    C   D    F
0   A0  B0   C0  D0  NaN
1   A1  B1   C1  D1  NaN
2   A2  B2   C2  D2  NaN
3   A3  B3   C3  D3  NaN
4  NaN  B2  NaN  D2   F2
5  NaN  B3  NaN  D3   F3
6  NaN  B6  NaN  D6   F6
7  NaN  B7  NaN  D7   F7

In [167]:
df1.append(df4, ignore_index=True)

/home/raonbit/anaconda3/envs/tensorflow/lib/python3.6/site-packages/pandas/core/frame.py:6201: FutureWarning: Sorting because non-concatenation axis is not aligned. A future version
of pandas will change to not sort by default.

To accept the future behavior, pass 'sort=True'.

To retain the current behavior and silence the warning, pass sort=False

  sort=sort)

     A   B    C   D    F
0   A0  B0   C0  D0  NaN
1   A1  B1   C1  D1  NaN
2   A2  B2   C2  D2  NaN
3   A3  B3   C3  D3  NaN
4  NaN  B2  NaN  D2   F2
5  NaN  B3  NaN  D3   F3
6  NaN  B6  NaN  D6   F6
7  NaN  B7  NaN  D7   F7

In [96]:
s1 = pd.Series(['X0', 'X1', 'X2', 'X3'], name='X')

In [97]:
print(df1);print();print(s1)
pd.concat([df1, s1], axis=1)

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3

0    X0
1    X1
2    X2
3    X3
Name: X, dtype: object

    A   B   C   D   X
0  A0  B0  C0  D0  X0
1  A1  B1  C1  D1  X1
2  A2  B2  C2  D2  X2
3  A3  B3  C3  D3  X3

In [99]:
s2 = pd.Series(['_0', '_1', '_2', '_3'])
print(df1);print();print(s2)
pd.concat([df1, s2, s2, s2], axis=1)

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3

0    _0
1    _1
2    _2
3    _3
dtype: object

    A   B   C   D   0   1   2
0  A0  B0  C0  D0  _0  _0  _0
1  A1  B1  C1  D1  _1  _1  _1
2  A2  B2  C2  D2  _2  _2  _2
3  A3  B3  C3  D3  _3  _3  _3

In [100]:
print(df1);print();print(s1)
pd.concat([df1, s1], axis=1, ignore_index=True)

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3

0    X0
1    X1
2    X2
3    X3
Name: X, dtype: object

    0   1   2   3   4
0  A0  B0  C0  D0  X0
1  A1  B1  C1  D1  X1
2  A2  B2  C2  D2  X2
3  A3  B3  C3  D3  X3

In [102]:
s3 = pd.Series([0, 1, 2, 3], name='foo')
s4 = pd.Series([0, 1, 2, 3])
s5 = pd.Series([0, 1, 4, 5])
print(s3);print();print(s4);print();print(s5)
pd.concat([s3, s4, s5], axis=1)

0    0
1    1
2    2
3    3
Name: foo, dtype: int64

0    0
1    1
2    2
3    3
dtype: int64

0    0
1    1
2    4
3    5
dtype: int64

   foo  0  1
0    0  0  0
1    1  1  1
2    2  2  4
3    3  3  5

In [103]:
pd.concat([s3, s4, s5], axis=1, keys=['red','blue','yellow'])

   red  blue  yellow
0    0     0       0
1    1     1       1
2    2     2       4
3    3     3       5

In [104]:
pd.concat(frames, keys=['x', 'y', 'z'])

        A    B    C    D
x 0    A0   B0   C0   D0
  1    A1   B1   C1   D1
  2    A2   B2   C2   D2
  3    A3   B3   C3   D3
y 4    A4   B4   C4   D4
  5    A5   B5   C5   D5
  6    A6   B6   C6   D6
  7    A7   B7   C7   D7
z 8    A8   B8   C8   D8
  9    A9   B9   C9   D9
  10  A10  B10  C10  D10
  11  A11  B11  C11  D11

In [105]:
pieces = {'x': df1, 'y': df2, 'z': df3}
print(pieces)

{'x':     A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3, 'y':     A   B   C   D
4  A4  B4  C4  D4
5  A5  B5  C5  D5
6  A6  B6  C6  D6
7  A7  B7  C7  D7, 'z':       A    B    C    D
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11}

In [106]:
pd.concat(pieces)

        A    B    C    D
x 0    A0   B0   C0   D0
  1    A1   B1   C1   D1
  2    A2   B2   C2   D2
  3    A3   B3   C3   D3
y 4    A4   B4   C4   D4
  5    A5   B5   C5   D5
  6    A6   B6   C6   D6
  7    A7   B7   C7   D7
z 8    A8   B8   C8   D8
  9    A9   B9   C9   D9
  10  A10  B10  C10  D10
  11  A11  B11  C11  D11

In [107]:
pd.concat(pieces, keys=['z', 'y'])

        A    B    C    D
z 8    A8   B8   C8   D8
  9    A9   B9   C9   D9
  10  A10  B10  C10  D10
  11  A11  B11  C11  D11
y 4    A4   B4   C4   D4
  5    A5   B5   C5   D5
  6    A6   B6   C6   D6
  7    A7   B7   C7   D7

In [108]:
result.index.levels

FrozenList([['x', 'y', 'z'], [0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11]])

In [109]:
pd.concat(pieces, keys=['x', 'y', 'z'],
          levels=[['z', 'y', 'x', 'w']],
          names=['group_key'])

                A    B    C    D
group_key
x         0    A0   B0   C0   D0
          1    A1   B1   C1   D1
          2    A2   B2   C2   D2
          3    A3   B3   C3   D3
y         4    A4   B4   C4   D4
          5    A5   B5   C5   D5
          6    A6   B6   C6   D6
          7    A7   B7   C7   D7
z         8    A8   B8   C8   D8
          9    A9   B9   C9   D9
          10  A10  B10  C10  D10
          11  A11  B11  C11  D11

In [110]:
result.index.levels

FrozenList([['x', 'y', 'z'], [0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11]])

## appending rows to DataFrame

In [111]:
s2 = pd.Series(['X0', 'X1', 'X2', 'X3'], index=['A', 'B', 'C', 'D'])
df1.append(s2, ignore_index=True)

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3
4  X0  X1  X2  X3

In [112]:
dicts = [{'A': 1, 'B': 2, 'C': 3, 'X': 4},
         {'A': 5, 'B': 6, 'C': 7, 'Y': 8}]
df1.append(dicts, ignore_index=True)

/home/raonbit/anaconda3/envs/tensorflow/lib/python3.6/site-packages/pandas/core/frame.py:6201: FutureWarning: Sorting because non-concatenation axis is not aligned. A future version
of pandas will change to not sort by default.

To accept the future behavior, pass 'sort=True'.

To retain the current behavior and silence the warning, pass sort=False

  sort=sort)

    A   B   C    D    X    Y
0  A0  B0  C0   D0  NaN  NaN
1  A1  B1  C1   D1  NaN  NaN
2  A2  B2  C2   D2  NaN  NaN
3  A3  B3  C3   D3  NaN  NaN
4   1   2   3  NaN  4.0  NaN
5   5   6   7  NaN  NaN  8.0

## Database-style DataFrame joining/merging

In [114]:
left = pd.DataFrame({'key': ['K0', 'K1', 'K2', 'K3'],
                     'A': ['A0', 'A1', 'A2', 'A3'],
                     'B': ['B0', 'B1', 'B2', 'B3']})
right = pd.DataFrame({'key': ['K0', 'K1', 'K2', 'K3'],
                      'C': ['C0', 'C1', 'C2', 'C3'],
                      'D': ['D0', 'D1', 'D2', 'D3']})
print(left);print();print(right)
pd.merge(left, right, on='key')

  key   A   B
0  K0  A0  B0
1  K1  A1  B1
2  K2  A2  B2
3  K3  A3  B3

  key   C   D
0  K0  C0  D0
1  K1  C1  D1
2  K2  C2  D2
3  K3  C3  D3

  key   A   B   C   D
0  K0  A0  B0  C0  D0
1  K1  A1  B1  C1  D1
2  K2  A2  B2  C2  D2
3  K3  A3  B3  C3  D3

In [4]:
left = pd.DataFrame({'key1': ['K0', 'K0', 'K1', 'K2'],
                     'key2': ['K0', 'K1', 'K0', 'K1'],
                     'A': ['A0', 'A1', 'A2', 'A3'],
                     'B': ['B0', 'B1', 'B2', 'B3']})
right = pd.DataFrame({'key1': ['K0', 'K1', 'K1', 'K2'],
                      'key2': ['K0', 'K0', 'K0', 'K0'],
                      'C': ['C0', 'C1', 'C2', 'C3'],
                      'D': ['D0', 'D1', 'D2', 'D3']})
print(left);print();print(right)
pd.merge(left, right, on=['key1', 'key2'])

  key1 key2   A   B
0   K0   K0  A0  B0
1   K0   K1  A1  B1
2   K1   K0  A2  B2
3   K2   K1  A3  B3

  key1 key2   C   D
0   K0   K0  C0  D0
1   K1   K0  C1  D1
2   K1   K0  C2  D2
3   K2   K0  C3  D3

  key1 key2   A   B   C   D
0   K0   K0  A0  B0  C0  D0
1   K1   K0  A2  B2  C1  D1
2   K1   K0  A2  B2  C2  D2

In [5]:
print(left);print();print(right)
pd.merge(left, right, how='left', on=['key1', 'key2'])

  key1 key2   A   B
0   K0   K0  A0  B0
1   K0   K1  A1  B1
2   K1   K0  A2  B2
3   K2   K1  A3  B3

  key1 key2   C   D
0   K0   K0  C0  D0
1   K1   K0  C1  D1
2   K1   K0  C2  D2
3   K2   K0  C3  D3

  key1 key2   A   B    C    D
0   K0   K0  A0  B0   C0   D0
1   K0   K1  A1  B1  NaN  NaN
2   K1   K0  A2  B2   C1   D1
3   K1   K0  A2  B2   C2   D2
4   K2   K1  A3  B3  NaN  NaN

In [6]:
print(left);print();print(right)
pd.merge(left, right, how='right', on=['key1', 'key2'])

  key1 key2   A   B
0   K0   K0  A0  B0
1   K0   K1  A1  B1
2   K1   K0  A2  B2
3   K2   K1  A3  B3

  key1 key2   C   D
0   K0   K0  C0  D0
1   K1   K0  C1  D1
2   K1   K0  C2  D2
3   K2   K0  C3  D3

  key1 key2    A    B   C   D
0   K0   K0   A0   B0  C0  D0
1   K1   K0   A2   B2  C1  D1
2   K1   K0   A2   B2  C2  D2
3   K2   K0  NaN  NaN  C3  D3

In [7]:
print(left);print();print(right)
pd.merge(left, right, how='outer', on=['key1', 'key2'])

  key1 key2   A   B
0   K0   K0  A0  B0
1   K0   K1  A1  B1
2   K1   K0  A2  B2
3   K2   K1  A3  B3

  key1 key2   C   D
0   K0   K0  C0  D0
1   K1   K0  C1  D1
2   K1   K0  C2  D2
3   K2   K0  C3  D3

  key1 key2    A    B    C    D
0   K0   K0   A0   B0   C0   D0
1   K0   K1   A1   B1  NaN  NaN
2   K1   K0   A2   B2   C1   D1
3   K1   K0   A2   B2   C2   D2
4   K2   K1   A3   B3  NaN  NaN
5   K2   K0  NaN  NaN   C3   D3

In [8]:
print(left);print();print(right)
pd.merge(left, right, how='inner', on=['key1', 'key2'])

  key1 key2   A   B
0   K0   K0  A0  B0
1   K0   K1  A1  B1
2   K1   K0  A2  B2
3   K2   K1  A3  B3

  key1 key2   C   D
0   K0   K0  C0  D0
1   K1   K0  C1  D1
2   K1   K0  C2  D2
3   K2   K0  C3  D3

  key1 key2   A   B   C   D
0   K0   K0  A0  B0  C0  D0
1   K1   K0  A2  B2  C1  D1
2   K1   K0  A2  B2  C2  D2

In [9]:
left = pd.DataFrame({'A' : [1,2], 'B' : [1, 2]})
right = pd.DataFrame({'A' : [4,5,6], 'B': [2, 2, 2]})
print(left);print();print(right)
pd.merge(left, right, on='B', how='outer',
         validate="one_to_many")

   A  B
0  1  1
1  2  2

   A  B
0  4  2
1  5  2
2  6  2

   A_x  B  A_y
0    1  1  NaN
1    2  2  4.0
2    2  2  5.0
3    2  2  6.0

In [10]:
pd.merge(left, right, on='B', how='outer',
         validate="one_to_one")

MergeError: Merge keys are not unique in right dataset; not a one-to-one merge

In [127]:
pd.merge(left, right, on='B', how='outer',
         indicator=True)

   A_x  B  A_y     _merge
0    1  1  NaN  left_only
1    2  2  4.0       both
2    2  2  5.0       both
3    2  2  6.0       both

In [128]:
pd.merge(left, right, on='B', how='outer',
         indicator='indicator_column')

   A_x  B  A_y indicator_column
0    1  1  NaN        left_only
1    2  2  4.0             both
2    2  2  5.0             both
3    2  2  6.0             both

## Joining on index

In [14]:
left = pd.DataFrame({'A': ['A0', 'A1', 'A2'],
                     'B': ['B0', 'B1', 'B2']},
                    index=['K0', 'K1', 'K2'])
right = pd.DataFrame({'C': ['C0', 'C2', 'C3'],
                      'D': ['D0', 'D2', 'D3']},
                     index=['K0', 'K2', 'K3'])
print(left);print();print(right)
left.join(right)

     A   B
K0  A0  B0
K1  A1  B1
K2  A2  B2

     C   D
K0  C0  D0
K2  C2  D2
K3  C3  D3

     A   B    C    D
K0  A0  B0   C0   D0
K1  A1  B1  NaN  NaN
K2  A2  B2   C2   D2

In [15]:
print(left);print();print(right)
left.join(right, how='outer')

     A   B
K0  A0  B0
K1  A1  B1
K2  A2  B2

     C   D
K0  C0  D0
K2  C2  D2
K3  C3  D3

      A    B    C    D
K0   A0   B0   C0   D0
K1   A1   B1  NaN  NaN
K2   A2   B2   C2   D2
K3  NaN  NaN   C3   D3

In [16]:
print(left);print();print(right)
pd.merge(left, right, how='outer')

     A   B
K0  A0  B0
K1  A1  B1
K2  A2  B2

     C   D
K0  C0  D0
K2  C2  D2
K3  C3  D3

MergeError: No common columns to perform merge on. Merge options: left_on=None, right_on=None, left_index=False, right_index=False

In [134]:
print(left);print();print(right)
pd.merge(left, right, how='outer',
         left_index=True, right_index=True)

     A   B
K0  A0  B0
K1  A1  B1
K2  A2  B2

     C   D
K0  C0  D0
K2  C2  D2
K3  C3  D3

      A    B    C    D
K0   A0   B0   C0   D0
K1   A1   B1  NaN  NaN
K2   A2   B2   C2   D2
K3  NaN  NaN   C3   D3

In [133]:
print(left);print();print(right)
left.join(right, how='inner')

     A   B
K0  A0  B0
K1  A1  B1
K2  A2  B2

     C   D
K0  C0  D0
K2  C2  D2
K3  C3  D3

     A   B   C   D
K0  A0  B0  C0  D0
K2  A2  B2  C2  D2

In [136]:
print(left);print();print(right)
pd.merge(left, right, how='inner',
         left_index=True, right_index=True)

     A   B
K0  A0  B0
K1  A1  B1
K2  A2  B2

     C   D
K0  C0  D0
K2  C2  D2
K3  C3  D3

     A   B   C   D
K0  A0  B0  C0  D0
K2  A2  B2  C2  D2

## Joining key columns on an index

In [11]:
left = pd.DataFrame({'A': ['A0', 'A1', 'A2', 'A3'],
                     'B': ['B0', 'B1', 'B2', 'B3'],
                     'key': ['K0', 'K1', 'K0', 'K1']})
right = pd.DataFrame({'C': ['C0', 'C1'],
                      'D': ['D0', 'D1']},
                     index=['K0', 'K1'])

In [12]:
print(left);print();print(right)
left.join(right, on='key')

    A   B key
0  A0  B0  K0
1  A1  B1  K1
2  A2  B2  K0
3  A3  B3  K1

     C   D
K0  C0  D0
K1  C1  D1

    A   B key   C   D
0  A0  B0  K0  C0  D0
1  A1  B1  K1  C1  D1
2  A2  B2  K0  C0  D0
3  A3  B3  K1  C1  D1

In [13]:
pd.merge(left, right, left_on='key', how='left',
         right_index=True,sort=False)

    A   B key   C   D
0  A0  B0  K0  C0  D0
1  A1  B1  K1  C1  D1
2  A2  B2  K0  C0  D0
3  A3  B3  K1  C1  D1

In [19]:
left = pd.DataFrame({'A': ['A0', 'A1', 'A2', 'A3'],
                     'B': ['B0', 'B1', 'B2', 'B3'],
                     'key1': ['K0', 'K0', 'K1', 'K2'],
                     'key2': ['K0', 'K1', 'K0', 'K1']})
index = pd.MultiIndex.from_tuples([('K0', 'K0'), ('K1', 'K0'),
                                   ('K2', 'K0'), ('K2', 'K1')])
right = pd.DataFrame({'C': ['C0', 'C1', 'C2', 'C3'],
                      'D': ['D0', 'D1', 'D2', 'D3']},
                     index=index)
print(left);print();print(index);print();print(right)

    A   B key1 key2
0  A0  B0   K0   K0
1  A1  B1   K0   K1
2  A2  B2   K1   K0
3  A3  B3   K2   K1

MultiIndex(levels=[['K0', 'K1', 'K2'], ['K0', 'K1']],
           labels=[[0, 1, 2, 2], [0, 0, 0, 1]])

        C   D
K0 K0  C0  D0
K1 K0  C1  D1
K2 K0  C2  D2
   K1  C3  D3

In [20]:
left.join(right, on=['key1', 'key2'])

    A   B key1 key2    C    D
0  A0  B0   K0   K0   C0   D0
1  A1  B1   K0   K1  NaN  NaN
2  A2  B2   K1   K0   C1   D1
3  A3  B3   K2   K1   C3   D3

In [23]:
left.join(right, on=['key1', 'key2'], how='inner')

    A   B key1 key2   C   D
0  A0  B0   K0   K0  C0  D0
2  A2  B2   K1   K0  C1  D1
3  A3  B3   K2   K1  C3  D3

## Joining a single Index to a Multi-index

In [149]:
left = pd.DataFrame({'A': ['A0', 'A1', 'A2'],
                     'B': ['B0', 'B1', 'B2']},
                    index=pd.Index(['K0', 'K1', 'K2'], name='key'))
index = pd.MultiIndex.from_tuples([('K0', 'Y0'), ('K1', 'Y1'),
                                   ('K2', 'Y2'), ('K2', 'Y3')],
                                  names=['key', 'Y'])
right = pd.DataFrame({'C': ['C0', 'C1', 'C2', 'C3'],
                      'D': ['D0', 'D1', 'D2', 'D3']},
                     index=index)
print(left);print();print(index);print();print(right)

      A   B
key
K0   A0  B0
K1   A1  B1
K2   A2  B2

MultiIndex(levels=[['K0', 'K1', 'K2'], ['Y0', 'Y1', 'Y2', 'Y3']],
           labels=[[0, 1, 2, 2], [0, 1, 2, 3]],
           names=['key', 'Y'])

         C   D
key Y
K0  Y0  C0  D0
K1  Y1  C1  D1
K2  Y2  C2  D2
    Y3  C3  D3

In [150]:
left.join(right, how='inner')

         A   B   C   D
key Y
K0  Y0  A0  B0  C0  D0
K1  Y1  A1  B1  C1  D1
K2  Y2  A2  B2  C2  D2
    Y3  A2  B2  C3  D3

In [151]:
pd.merge(left.reset_index(), right.reset_index(),
         on=['key'], how='inner').set_index(['key','Y'])

         A   B   C   D
key Y
K0  Y0  A0  B0  C0  D0
K1  Y1  A1  B1  C1  D1
K2  Y2  A2  B2  C2  D2
    Y3  A2  B2  C3  D3

## Joining with two multi-indexes

In [153]:
index = pd.MultiIndex.from_tuples([('K0', 'X0'), ('K0', 'X1'),
                                   ('K1', 'X2')],
                                  names=['key', 'X'])
left = pd.DataFrame({'A': ['A0', 'A1', 'A2'],
                     'B': ['B0', 'B1', 'B2']},
                    index=index)
print(index);print();print(left)

MultiIndex(levels=[['K0', 'K1'], ['X0', 'X1', 'X2']],
           labels=[[0, 0, 1], [0, 1, 2]],
           names=['key', 'X'])

         A   B
key X
K0  X0  A0  B0
    X1  A1  B1
K1  X2  A2  B2

In [154]:
pd.merge(left.reset_index(), right.reset_index(),
         on=['key'], how='inner').set_index(['key','X','Y'])

            A   B   C   D
key X  Y
K0  X0 Y0  A0  B0  C0  D0
    X1 Y0  A1  B1  C0  D0
K1  X2 Y1  A2  B2  C1  D1

## Merging on a combination of columns and index levels

In [156]:
left_index = pd.Index(['K0', 'K0', 'K1', 'K2'], name='key1')
left = pd.DataFrame({'A': ['A0', 'A1', 'A2', 'A3'],
                     'B': ['B0', 'B1', 'B2', 'B3'],
                     'key2': ['K0', 'K1', 'K0', 'K1']},
                    index=left_index)
right_index = pd.Index(['K0', 'K1', 'K2', 'K2'], name='key1')
right = pd.DataFrame({'C': ['C0', 'C1', 'C2', 'C3'],
                      'D': ['D0', 'D1', 'D2', 'D3'],
                      'key2': ['K0', 'K0', 'K0', 'K1']},
                     index=right_index)
print(left);print();print(right)

       A   B key2
key1
K0    A0  B0   K0
K0    A1  B1   K1
K1    A2  B2   K0
K2    A3  B3   K1

       C   D key2
key1
K0    C0  D0   K0
K1    C1  D1   K0
K2    C2  D2   K0
K2    C3  D3   K1

In [157]:
left.merge(right, on=['key1', 'key2'])

       A   B key2   C   D
key1
K0    A0  B0   K0  C0  D0
K1    A2  B2   K0  C1  D1
K2    A3  B3   K1  C3  D3

## DataFrame save and load

In [69]:
save_df = pd.DataFrame({'C': ['C0', 'C1', 'C2', 'C3'],
                      'D': ['D0', 'D1', 'D2', 'D3'],
                      'key2': ['K0', 'K0', 'K0', 'K1']})
save_df

    C   D key2
0  C0  D0   K0
1  C1  D1   K0
2  C2  D2   K0
3  C3  D3   K1

In [77]:
save_df.to_csv('./dataframe1.csv')

In [71]:
load_df = pd.read_csv("./dataframe.csv")
load_df

   Unnamed: 0   C   D key2
0           0  C0  D0   K0
1           1  C1  D1   K0
2           2  C2  D2   K0
3           3  C3  D3   K1

In [72]:
save_df.to_excel('./dataframe.xlsx')

In [73]:
load_df2 = pd.read_excel("./dataframe.xlsx")
load_df2

    C   D key2
0  C0  D0   K0
1  C1  D1   K0
2  C2  D2   K0
3  C3  D3   K1

In [74]:
save_df.to_pickle('./dataframe.pkl')

In [75]:
load_df3 = pd.read_pickle("./dataframe.pkl")
load_df3

    C   D key2
0  C0  D0   K0
1  C1  D1   K0
2  C2  D2   K0
3  C3  D3   K1